OpenYellow/src/InformationRegisters/СтатистикаРепозиториев/СтатистикаРепозиториев.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>СтатистикаРепозиториев</name>
  <resources>
    <name>Звезды</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Подписчики</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Форки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПрошлоеМесто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Репозиторий</name>
    <type>
      <types>CatalogRef.Репозитории</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

OpenYellow/src/Catalogs/Репозитории/Репозитории.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Репозитории</name>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Авторы</types>
    </type>
  </attributes>
  <attributes>
    <name>Описание</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоФорк</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>URL</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Лицензия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПоследнееОбновление</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Язык</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>400</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Размер</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Группа</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ДатаДобавления</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>Тэги</name>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

OpenYellow/src/HTTPServices/data/Module.bsl
Функция getDataGET(Запрос)
    
    Запрос = Новый Запрос("ВЫБРАТЬ ПЕРВЫЕ 500
                          | Репозитории.Наименование КАК name,
                          | Репозитории.URL КАК url,
                          | Репозитории.Автор.URL КАК author,
                          | Репозитории.Описание КАК description,
                          | Репозитории.ДатаСоздания КАК createddate,
                          | Репозитории.Лицензия КАК license,
                          | СтатистикаРепозиториевСрезПоследних.Звезды КАК stars,
                          | СтатистикаРепозиториевСрезПоследних.Форки КАК forks,
                          | Репозитории.Автор.Аватар КАК pic,
                          | Репозитории.Язык КАК lang,
                          | Репозитории.Размер КАК size,
                          | Репозитории.ПоследнееОбновление КАК updateddate,
                          | СтатистикаРепозиториевСрезПоследних.ПрошлоеМесто КАК prevPlace
                          |ИЗ
                          | Справочник.Репозитории КАК Репозитории
                          |     ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатистикаРепозиториев КАК СтатистикаРепозиториевСрезПоследних
                          |     ПО (СтатистикаРепозиториевСрезПоследних.Репозиторий = Репозитории.Ссылка)
                          |ГДЕ
                          | НЕ Репозитории.ПометкаУдаления
                          |
                          |УПОРЯДОЧИТЬ ПО
                          | СтатистикаРепозиториевСрезПоследних.Звезды УБЫВ,
                          | СтатистикаРепозиториевСрезПоследних.Форки УБЫВ,
                          | Репозитории.ДатаСоздания");
    
    Результат = Запрос.Выполнить().Выгрузить();   
    Данные = Инструментарий.ТаблицаЗначенийВМассив(Результат);
    Счетчик = 1;
    
    Для Каждого Позиция Из Данные Цикл
        
        Изменение = ?(Позиция.prevPlace = 0, Счетчик, Позиция.prevPlace - Счетчик);

        Динамика  = ?(Изменение < 0, "down","up");
        Динамика  = ?(Изменение = 0, "same", Динамика);
                
        Позиция.Вставить("dynamic" , Динамика);
        Позиция.Вставить("сhanging", Изменение);
        Позиция.Вставить("place"   , Счетчик);
        
        Счетчик = Счетчик + 1;

    КонецЦикла;
    
    Ответ       = Новый HTTPСервисОтвет(200);
         
    ПотокОтвета = Ответ.ПолучитьТелоКакПоток();
    ОтветJSON   = Новый ЗаписьJSON;
    ОтветJSON.ОткрытьПоток(ПотокОтвета, "UTF-8");
    
    НастройкиСериализации = Новый НастройкиСериализацииJSON;
    НастройкиСериализации.ВариантЗаписиДаты      = ВариантЗаписиДатыJSON.УниверсальнаяДата;
    НастройкиСериализации.ФорматСериализацииДаты = ФорматДатыJSON.ISO;
    
    Попытка
        ЗаписатьJSON(ОтветJSON, Данные, НастройкиСериализации);
    Исключение
        ОО = ПодробноеПредставлениеОшибки(ИнформацияОбОшибке());
    КонецПопытки;
    
    ОтветJSON.Закрыть();
    ПотокОтвета.Закрыть();
    
    Возврат Ответ;
    
КонецФункции

Функция getDataCors(Запрос)
    Ответ = Новый HTTPСервисОтвет(200);
    
    Ответ.Заголовки.Вставить("Access-Control-Allow-Credentials", "true");
    Ответ.Заголовки.Вставить("Access-Control-Allow-Methods", "*");
    Ответ.Заголовки.Вставить("Access-Control-Allow-Headers", "cache-control,expires,pragma,Access-Control-Allow-Headers, Origin,Accept, X-Requested-With, Content-Type, Access-Control-Request-Method, Access-Control-Request-Headers");

    Возврат Ответ;
КонецФункции
